[
    {
        "id": 1,
        "product_name": "Green Banana",
        "price": 40,
        "strikeoutPrice": "70",
        "quantity": "5 pcs",
        "image": "/assets/vegetables/banana.jpg",
        "category": "vegetables",
        "description": "Nutritious and filling, Green Bananas are rich in fiber and resistant starch—ideal for managing blood sugar and digestion. Perfect for making healthy curries, chips, or stir-fries. Sourced fresh, they’re your guilt-free carb alternative. Taste health in every bite!"
    },
    {
        "id": 2,
        "product_name": "Brinjal",
        "price": 20,
        "strikeoutPrice": "50",
        "quantity": "500 g",
        "image": "/assets/vegetables/brinjal.jpg",
        "category": "vegetables",
        "description": "Glossy and flavorful, our Brinjals are perfect for roasting, stuffing, or grilling. Rich in fiber and antioxidants, they support heart health and digestion. Add color and nutrition to your plate with this versatile veggie. Eat well, live better!"
    },
    {
        "id": 3,
        "product_name": "Chilly",
        "price": 40,
        "strikeoutPrice": "70",
        "quantity": "100 g",
        "image": "/assets/vegetables/chilly.jpg",
        "category": "vegetables",
        "description": "Add spice to life with our farm-fresh Chillies! Perfect for giving your dishes a bold, fiery kick. Loaded with Vitamin C and antioxidants to boost immunity. A must-have for every kitchen — where flavor meets freshness!"
    },
    {
        "id": 4,
        "product_name": "Potato",
        "price": 30,
        "strikeoutPrice": "70",
        "quantity": "500 g",
        "image": "/assets/vegetables/potato.jpg",
        "category": "vegetables",
        "description": "Golden, earthy, and versatile! Our fresh Potatoes are perfect for curries, fries, and mash. Rich in potassium and energy, they make every meal heartier. Stock up on this timeless classic — simple, satisfying, and essential!"
    },
    {
        "id": 5,
        "product_name": "Carrot",
        "price": 50,
        "strikeoutPrice": "70",
        "quantity": "1 kg",
        "image": "/assets/vegetables/carrot.jpeg",
        "category": "vegetables",
        "description": "Bright, crunchy, and naturally sweet, Carrots are loaded with beta-carotene for glowing skin and sharp vision. Ideal for salads, juices, and cooking. Taste the crunch of freshness in every bite — eat vibrant, live vibrant!"
    },
    {
        "id": 6,
        "product_name": "Tomato",
        "price": 20,
        "strikeoutPrice": "40",
        "quantity": "1 kg",
        "image": "/assets/vegetables/tomato.jpg",
        "category": "vegetables",
        "description": "Juicy and ripe, our Tomatoes bring a burst of flavor to every dish. Full of antioxidants like lycopene, they promote heart health and glowing skin. Ideal for sauces, salads, or chutneys — taste the tang of wellness!"
    },
    {
        "id": 7,
        "product_name": "Big Onion",
        "price": 60,
        "strikeoutPrice": 80,
        "quantity": "1 kg",
        "image": "/assets/vegetables/big-onion.jpeg",
        "category": "vegetables",
        "description": "Sweet, bold, and aromatic, Big Onions are the heart of every flavorful dish. Rich in antioxidants and versatile in use — from curries to salads. Freshly harvested for your everyday kitchen needs. A flavor essential!"
    },
    {
        "id": 8,
        "product_name": "Small Onion",
        "price": 120,
        "strikeoutPrice": 150,
        "quantity": "1 kg",
        "image": "/assets/vegetables/small-onion.jpeg",
        "category": "vegetables",
        "description": "Pungent and flavorful, Small Onions add depth and richness to traditional dishes. Packed with nutrients and a powerful punch, they're a kitchen must-have. Elevate your curries and gravies with this authentic ingredient!"
    },
    {
        "id": 9,
        "product_name": "Radish",
        "price": 40,
        "strikeoutPrice": "60",
        "quantity": "1 kg",
        "image": "/assets/vegetables/radish.jpeg",
        "category": "vegetables",
        "description": "Crunchy, peppery, and nutrient-packed! Radish supports detox and digestion while adding zing to your salads, sambars, and stir-fries. Fresh from the farm, it's your crunchy companion to a cleaner, healthier diet."
    },
    {
        "id": 10,
        "product_name": "Kovaikkai",
        "price": 80,
        "strikeoutPrice": 100,
        "quantity": "500 g",
        "image": "/assets/vegetables/kovaikkai.jpeg",
        "category": "vegetables",
        "description": "Tender and tasty, Kovaikkai (Ivy Gourd) is perfect for stir-fries and curries. Low in calories and high in fiber, it's your go-to for light, healthy meals. A flavorful choice for every health-conscious kitchen!"
    },
    {
        "id": 11,
        "product_name": "Organic Poondu",
        "price": 70,
        "strikeoutPrice": "120",
        "quantity": "500 g",
        "image": "/assets/vegetables/organic-poondu.jpg",
        "category": "vegetables",
        "description": "Grown without chemicals, our Organic Garlic delivers rich flavor and health benefits. Boosts immunity, fights infection, and enhances taste in every dish. A must for conscious cooks seeking both flavor and wellness!"
    },
    {
        "id": 12,
        "product_name": "Poondu",
        "price": 120,
        "strikeoutPrice": "160",
        "quantity": "1 kg",
        "image": "/assets/vegetables/poondu.jpg",
        "category": "vegetables",
        "description": "Strong, pungent, and packed with power! Poondu (Garlic) enhances flavor while promoting heart and immune health. Perfect for every recipe—from pickles to pastas. Taste the spice of tradition!"
    },
    {
        "id": 13,
        "product_name": "Grandiflora",
        "price": 70,
        "strikeoutPrice": "120",
        "quantity": "1 bunch",
        "image": "/assets/vegetables/grandiflora.jpg",
        "category": "greens",
        "description": "Packed with iron, calcium, and folate, Grandiflora leaves are a natural health booster. Ideal for soups or poriyals, these tender greens promote vitality and digestion. A traditional supergreen with modern wellness benefits!"
    },
    {
        "id": 14,
        "product_name": "Drumstick",
        "price": 40,
        "strikeoutPrice": "70",
        "quantity": "5 pcs",
        "image": "/assets/vegetables/drumstick.jpg",
        "category": "vegetables",
        "description": "Tender and nutritious, Drumsticks are loaded with vitamins and minerals. Ideal for sambar, curries, or soups — they enhance flavor and boost wellness. Farm-fresh and rich in antioxidants, it’s a must-have in every South Indian kitchen!"
    },
    {
        "id": 15,
        "product_name": "Drumstick Leaf",
        "price": 30,
        "strikeoutPrice": "50",
        "quantity": "1 bunch",
        "image": "/assets/vegetables/drumstick-leaf.png",
        "category": "greens",
        "description": "Nature’s green powerhouse! Packed with essential vitamins, iron, and antioxidants, these miracle leaves boost immunity, enhance energy, and support overall wellness. Perfect for soups, curries, or health drinks. Freshly harvested for maximum nutrition — bring home the superfood your body deserves. Eat fresh, live strong!"
    },
    {
        "id": 16,
        "product_name": "Pudina",
        "price": 10,
        "strikeoutPrice": "20",
        "quantity": "1 bunch",
        "image": "/assets/vegetables/pudina.jpg",
        "category": "greens",
        "description": "Refreshing and aromatic, Pudina (Mint) is perfect for chutneys, teas, and garnishes. Packed with cooling properties and digestion benefits, it’s a flavorful must-have in every kitchen. Freshness in every leaf — spice up your meals naturally!"
    },
    {
        "id": 17,
        "product_name": "Ginger",
        "price": 40,
        "strikeoutPrice": "70",
        "quantity": "100 g",
        "image": "/assets/vegetables/ginger.jpg",
        "category": "vegetables",
        "description": "Zesty, warming, and healing — Ginger boosts immunity, fights inflammation, and adds kick to every dish. Ideal for teas, curries, and marinades. Freshly harvested for bold flavor and wellness in every slice!"
    },
    {
        "id": 18,
        "product_name": "Snake Guard",
        "price": 40,
        "strikeoutPrice": "70",
        "quantity": "5 pcs",
        "image": "/assets/vegetables/snake-guard.jpeg",
        "category": "vegetables",
        "description": "Mild in flavor but rich in health benefits, Snake Gourd aids digestion and cools the body. Ideal for stir-fries and stews, it’s a staple in healthy Indian cooking. Eat smart, feel light!"
    },
    {
        "id": 19,
        "product_name": "Curry Leaf",
        "price": 5,
        "strikeoutPrice": "15",
        "quantity": "1 bunch",
        "image": "/assets/vegetables/curry-leaves.jpg",
        "category": "greens",
        "description": "Fragrant and flavorful, Curry Leaves infuse dishes with signature aroma and taste. Rich in iron and antioxidants, they enhance both flavor and nutrition. A classic touch to every South Indian dish!"
    },
    {
        "id": 20,
        "product_name": "Corindar",
        "price": 10,
        "strikeoutPrice": "30",
        "quantity": "1 bunch",
        "image": "/assets/vegetables/corindar.jpg",
        "category": "greens",
        "description": "Fresh and citrusy, Coriander leaves brighten up any dish — from curries to chutneys. Loaded with vitamins and detoxifying properties. Add a touch of green and goodness to your cooking!"
    },
    {
        "id": 21,
        "product_name": "Bitter Guard",
        "price": 60,
        "strikeoutPrice": "80",
        "quantity": "1 kg",
        "image": "/assets/vegetables/bitter-guard.jpeg",
        "category": "vegetables",
        "description": "Don’t let the name fool you — Bitter Gourd is a health gem! Regulates blood sugar, detoxifies the body, and adds unique flavor. Ideal for stir-fries and juices. Eat bitter, feel better!"
    },
    {
        "id": 22,
        "product_name": "Beans",
        "price": 30,
        "strikeoutPrice": "50",
        "quantity": "1 kg",
        "image": "/assets/vegetables/beans.jpeg",
        "category": "vegetables",
        "description": "Tender, crunchy, and loaded with fiber and protein. Our fresh Beans are perfect for stir-fries, curries, or simply steamed. Fuel your day with this green energy booster — eat healthy, stay active!"
    }
]